src/Конфигурация/Documents/НачисленияСотрудникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Document>
		<Properties>
			<Name>НачисленияСотрудникам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.ОсновныеНачисления</xr:Item>
				<xr:Item>CalculationRegister.ДополнительныеНачисления</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>График</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачисленияДоп</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ДополнительныеНачисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Конфигурация/Documents/НачисленияСотрудникам/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура УстановитьДанныеВыбора(Данные, ВыбранноеЗначение)
	Модифицированность = Истина;
	Данные.Сотрудник = ВыбранноеЗначение.Сотрудник;
	Данные.Должность = ВыбранноеЗначение.Должность;
	Данные.Размер    = ВыбранноеЗначение.Оклад;
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Данные = Элементы.Начисления.ТекущиеДанные;
	ИнтерактивныеОперацииКлиент.ОткрытьФормуВыбораСотрудника(
		  Данные
		, Элемент
		, Новый Структура("Период,Должность", Данные.ДатаНачала)
	);
КонецПроцедуры
&НаКлиенте
Процедура НачисленияСотрудникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Элемент.СписокВыбора.Очистить();
		Элемент.СписокВыбора.Добавить(ВыбранноеЗначение.Сотрудник);
		УстановитьДанныеВыбора(Элементы.Начисления.ТекущиеДанные, ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачисленияДолжностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Данные = Элементы.Начисления.ТекущиеДанные;
	ИнтерактивныеОперацииКлиент.ОткрытьФормуВыбораСотрудника(
		  Данные
		, Элемент
		, Новый Структура("Период,Сотрудник", Данные.ДатаНачала)
	);
КонецПроцедуры
&НаКлиенте
Процедура НачисленияДолжностьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Элемент.СписокВыбора.Очистить();
		Элемент.СписокВыбора.Добавить(ВыбранноеЗначение.Должность);
		УстановитьДанныеВыбора(Элементы.Начисления.ТекущиеДанные, ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачисленияРазмерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Данные = Элементы.Начисления.ТекущиеДанные;
	ИнтерактивныеОперацииКлиент.ОткрытьФормуВыбораСотрудника(
		  Данные
		, Элемент
		, Новый Структура("Период,Сотрудник,Должность", Данные.ДатаНачала)
	);
КонецПроцедуры
&НаКлиенте
Процедура НачисленияРазмерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Элемент.СписокВыбора.Очистить();
		Элемент.СписокВыбора.Добавить(ВыбранноеЗначение.Оклад);
		Данные = Элементы.Начисления.ТекущиеДанные;
		УстановитьДанныеВыбора(Данные, ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачисленияДопСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Данные = Элементы.НачисленияДоп.ТекущиеДанные;
	ИнтерактивныеОперацииКлиент.ОткрытьФормуВыбораСотрудника(
		  Данные
		, Элемент
		, Новый Структура("Период,Должность", Объект.Дата)
		, Новый Структура("ОтображатьОклад", Ложь)
	);	
КонецПроцедуры
&НаКлиенте
Процедура НачисленияДопСотрудникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Модифицированность = Истина;
		Элемент.СписокВыбора.Очистить();
		Элемент.СписокВыбора.Добавить(ВыбранноеЗначение.Сотрудник);
		Данные = Элементы.НачисленияДоп.ТекущиеДанные;
		Данные.Сотрудник = ВыбранноеЗначение.Сотрудник;
		Данные.Должность = ВыбранноеЗначение.Должность;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачисленияДопДолжностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Данные = Элементы.НачисленияДоп.ТекущиеДанные;
	ИнтерактивныеОперацииКлиент.ОткрытьФормуВыбораСотрудника(
		  Данные
		, Элемент
		, Новый Структура("Период,Сотрудник", Объект.Дата)
		, Новый Структура("ОтображатьОклад", Ложь)
	);	
КонецПроцедуры
&НаКлиенте
Процедура НачисленияДопДолжностьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Модифицированность = Истина;
		Элемент.СписокВыбора.Очистить();
		Элемент.СписокВыбора.Добавить(ВыбранноеЗначение.Сотрудник);
		Данные = Элементы.НачисленияДоп.ТекущиеДанные;
		Данные.Сотрудник = ВыбранноеЗначение.Сотрудник;
		Данные.Должность = ВыбранноеЗначение.Должность;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачисленияДатаНачалаПриИзменении(Элемент)
	Элементы.Начисления.ТекущиеДанные.Размер = 0;
КонецПроцедуры

&НаКлиенте
Процедура НачисленияДопВидНачисленияПриИзменении(Элемент)
	Данные = Элементы.НачисленияДоп.ТекущиеДанные;
	Если Данные.ВидНачисления = ПредопределенноеЗначение("ПланВидовРасчета.ДополнительныеНачисления.Надбавка") Тогда
		Данные.Размер = 1;
		Элементы.НачисленияДопРазмер.Доступность = Ложь;
	ИначеЕсли Данные.ВидНачисления = ПредопределенноеЗначение("ПланВидовРасчета.ДополнительныеНачисления.Премия") Тогда
		Данные.Размер = 0;
		Элементы.НачисленияДопРазмер.Доступность = Истина;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура НачисленияДопПриАктивизацииСтроки(Элемент)
	Элементы.НачисленияДопРазмер.Доступность = (
		Элементы.НачисленияДоп.ТекущиеДанные.ВидНачисления 
		<> 
		ПредопределенноеЗначение("ПланВидовРасчета.ДополнительныеНачисления.Надбавка")
	);
КонецПроцедуры
